##DESCRIPTION
##  
##ENDDESCRIPTION

##KEYWORDS('difference', 'quotient')

## DBsubject('Calculus')
## DBchapter('Limits and Derivatives')
## DBsection('Definition of the Derivative')
## Date('7/28/2011')
## Author('Darwyn Cook')
## Institution('Alfred University')
## TitleText1('AUCI')
## EditionText1('1')
## AuthorText1('')
## Section1('2.3')
## Problem1('')

########################################################################

DOCUMENT();      

loadMacros(
   "PGstandard.pl",     # Standard macros for PG language
   "MathObjects.pl",
   #"source.pl",        # allows code to be displayed on certain sites.
   "PGcourse.pl",      # Customization file for the course
   "Alfredmacros.pl",
   "contextLimitedPolynomial.pl",
   "weightedGrader.pl",
);
jsmathmode();
install_weighted_grader();

# Print problem number and point value (weight) for the problem
TEXT(beginproblem());

# Show which answers are correct and which ones are incorrect
$showPartialCorrectAnswers = 1;

##############################################################
#
#  Setup
#
#  Define the function f and the terms in the numerator of the difference
#  quotient. We do this at a general point x, and at a fixed point a.
Context("Numeric");
Context()->{error}{msg}{"'deltax' is not defined in this context"} 
= "You have to take the limit";
$cancel = Context()->copy;
$nodeltax=Context()->copy;

Context("LimitedPolynomial");
Context()->variables->add(deltax=>'Real');
Context()->variables->set(deltax => {TeX => '{\Delta x}'});
Context()->{error}{msg}{"You can only raise a variable to a power in a polynomial"} 
= "You didn't FOIL";
$foil = Context()->copy;

Context("LimitedPolynomial");
Context()->variables->add(deltax=>'Real');
Context()->variables->set(deltax => {TeX => '{\Delta x}'});
Context()->operators->undefine("-");
Context()->{error}{msg}{"Can't use '-' in this context"} 
= "You didn't cancel like terms";
Context()->{error}{msg}{"In a polynomial, you can only divide by numbers"} 
= "At this point you can simplify by dividing the numerator by deltax";
$cancel = Context()->copy;



Context("Numeric");
Context()->variables->add(deltax=>'Real');
Context()->variables->set(deltax => {TeX => '{\Delta x}'});
$DQ = Context()->copy;


$x0 = Compute(non_zero_random(1,9));

$a = Compute(non_zero_random(1,9));
$b = Compute(non_zero_random(1,9));
$c = Compute(non_zero_random(1,9));
$f = Formula($nodeltax,"$a*x^2+$b*x+$c")->reduce;
$fDQ = Formula($DQ,"$f");
$DQnum1 = $fDQ->substitute(x=>"x+deltax");
$DQnum1a = $fDQ->substitute(x=>"$x0+deltax");
$DQnum1simplified = Formula($foil,"$a*x^2+2*$a*x*deltax+$a*deltax^2+$b*x+$b*deltax+$c");
$DQnum1asimplified = $DQnum1simplified->substitute(x=>"$x0");
$DQnum2 = $fDQ;
$DQnum2a = $fDQ->substitute(x=>"$x0");
$DQden = Formula("deltax");

$DQnumerator = Formula($cancel,"2*$a*x*deltax+$a*deltax^2+$b*deltax");
$DQnumeratora = $DQnumerator->substitute(x=>"$x0");
$DQ = Formula($cancel,"2*$a*x+$a*deltax+$b");
$DQa = $DQ->substitute(x=>"$x0");

$fprime = $f->D('x');
$fprimea = $fprime->substitute(x=>"$x0");

##############################################################
#
#  Text
#
#

Context()->texStrings;
BEGIN_TEXT
Compute the derivative of \(f(x) = $f\) using the difference quotient definition. For \(\Delta x\) type deltax (with no spaces).
$BR
\[
\begin{aligned}
f^\prime(x) =& \lim_{\Delta x\to 0} \frac{f(x+\Delta x)-f(x)}{\Delta x}\\
&\\
&\hbox{substitute x + }\Delta x\hbox{ into f}\\
&\\
=&\lim_{\Delta x\to 0} \frac{\hbox{\{$DQnum1->ans_rule(10)\}}-{\hbox{\{$DQnum2->ans_rule(3)\}}}}{\hbox{\{$DQden->ans_rule(5)\}}}\\
&\\
&\hbox{FOIL}\\
&\\
=&\lim_{\Delta x\to 0} \frac{\hbox{\{$DQnum1->ans_rule(30)
\}}-{\hbox{\{$DQnum2->ans_rule(3)\}}}}{\hbox{\{$DQden->ans_rule(5)\}}}\\
&\\
&\hbox{cancel like terms in the numerator}\\
&\\
=&\lim_{\Delta x\to 0} \frac{\hbox{\{$DQnumerator->ans_rule(30)\}}}{\hbox{\{$DQden->ans_rule(5)\}}}\\
&\\
=&\lim_{\Delta x\to 0}\hbox{\{$DQ->ans_rule\}}\\
&\\
=&\hbox{\{$fprime->ans_rule\}}
\end{aligned}
\]
END_TEXT
Context()->normalStrings;

##############################################################
#
#  Answers
#
#

WEIGHTED_ANS($DQnum1->cmp, 17);
WEIGHTED_ANS($DQnum2->cmp, 5);
WEIGHTED_ANS($DQden->cmp , 3);

WEIGHTED_ANS($DQnum1simplified->cmp, 18);
WEIGHTED_ANS($DQnum2->cmp, 3);
WEIGHTED_ANS($DQden->cmp, 1);

WEIGHTED_ANS($DQnumerator->cmp, 18);
WEIGHTED_ANS($DQden->cmp, 1);

WEIGHTED_ANS($DQ->cmp, 17);
WEIGHTED_ANS($fprime->cmp, 17);
ENDDOCUMENT();        
