## DESCRIPTION
##  Algebra:  Scientific notation
## ENDDESCRIPTION


## DBsubject(Algebra)
## DBchapter(Algebra of real numbers and simplifying expressions)
## DBsection(Scientific notation)
## Date(11/05/2009)
## Institution(University of Minnesota)
## Author(Jonathan Rogness)
## MLT(Div_scientific)
## Level(2)
## MO(1)
## TitleText1('Algebra for College Students')
## AuthorText1('Kaufmann, Schwitters')
## EditionText1('8')
## Section1('5.7')
## Problem1('38')
## KEYWORDS('algebra', 'scientific notation', 'exponents')

########################################################################

DOCUMENT();      

loadMacros(
  "PGstandard.pl",
  "MathObjects.pl",
#  "contextScientificNotation.pl",
  "contextLimitedNumeric.pl",
  "PGcourse.pl"
);

########################################################################

TEXT(beginproblem());

$showPartialCorrectAnswers = 1;

########################################################################

Context("Numeric");

$a = random(63,69,3);
$b = $a / 3000;
$c = Compute("($a/$b)* 10**9");

Context("LimitedNumeric");
Context()->{format}{number}="%.0f";

$ans = Compute("$c");

########################################################################
Context()->texStrings;
BEGIN_TEXT
Use scientific notation and the properties of exponents to write the following expression in $BITALIC ordinary decimal notation.$EITALIC
\[
\frac{$a\;000\;000\;000}{$b}
\]
$PAR
Answer: \{ans_rule(20)\}
END_TEXT
Context()->normalStrings;

########################################################################

ANS($ans->cmp( checker => sub{
  my ( $correct, $student, $ansHash ) = @_;
  my $foo = "$ansHash->{original_student_ans}";
  if ($foo =~ /E/){
    Value->Error("Scientific notation is not allowed in the answer.");
  }
  return ($correct == $student);
}));


ENDDOCUMENT();
