##DESCRIPTION
##  
##ENDDESCRIPTION

##KEYWORDS('difference', 'quotient')

## DBsubject('Calculus')
## DBchapter('Limits and Derivatives')
## DBsection('Definition of the Derivative')
## Date('7/28/2011')
## Author('Darwyn Cook')
## Institution('Alfred University')
## TitleText1('AUCI')
## EditionText1('1')
## AuthorText1('')
## Section1('2.3')
## Problem1('')

########################################################################

DOCUMENT();      

loadMacros(
   "PGstandard.pl",     # Standard macros for PG language
   "MathObjects.pl",
   #"source.pl",        # allows code to be displayed on certain sites.
   "PGcourse.pl",      # Customization file for the course
   "unionTables.pl",
   "contextLimitedPolynomial.pl",
   "weightedGrader.pl",
   "parserFunction.pl",
);

install_weighted_grader();

# Print problem number and point value (weight) for the problem
TEXT(beginproblem());

# Show which answers are correct and which ones are incorrect
$showPartialCorrectAnswers = 1;

##############################################################
#
#  Setup
#
#  Define the function f and the terms in the numerator of the difference
#  quotient. We do this at a general point x, and at a fixed point a.
Context("Numeric");
Context()->{error}{msg}{"'deltax' is not defined in this context"} 
= "You have to take the limit";
$cancel = Context()->copy;
$nodeltax=Context()->copy;

Context("LimitedPolynomial");
Context()->variables->add(deltax=>'Real');
Context()->variables->set(deltax => {TeX => '{\Delta x}'});
Context()->{error}{msg}{"You can only raise a variable to a power in a polynomial"} 
= "You didn't FOIL";
$foil = Context()->copy;

Context("LimitedPolynomial");
Context()->variables->add(deltax=>'Real');
Context()->variables->set(deltax => {TeX => '{\Delta x}'});
Context()->operators->undefine("-");
Context()->{error}{msg}{"Can't use '-' in this context"} 
= "You didn't cancel like terms";
Context()->{error}{msg}{"In a polynomial, you can only divide by numbers"} 
= "At this point you can simplify by dividing the numerator by deltax";
$cancel = Context()->copy;



Context("Numeric");
Context()->variables->add(deltax=>'Real');
Context()->variables->set(deltax => {TeX => '{\Delta x}'});
$DQ = Context()->copy;

parserFunction(f => "sin(x^3-8x^2)");


$a = Compute(non_zero_random(1,9));
$b = Compute(non_zero_random(1,9));


$c = Compute(non_zero_random(2,9));
$f = Formula($nodeltax,"$c*x^2 - $b")->reduce;
$fDQ = Formula($DQ,"$f");
$DQnum1 = $fDQ->substitute(x=>"x+deltax");
$DQnum1a = $fDQ->substitute(x=>"$a+deltax");
$DQnum1simplified = Formula($foil,"$c*x^2+2*$c*x*deltax+$c*deltax^2 - $b");
$DQnum1asimplified = $DQnum1simplified->substitute(x=>"$a");
$DQnum2 = $fDQ;
$DQnum2a = $fDQ->substitute(x=>"$a");
$DQden = Formula("deltax");

$DQnumerator = Formula($cancel,"2*$c*x*deltax+$c*deltax^2");
$DQnumeratora = $DQnumerator->substitute(x=>"$a");
$DQ = Formula($cancel,"2*$c*x+$c*deltax");
$DQa = $DQ->substitute(x=>"$a");

$fprime = $f->D('x');
$fprimea = $fprime->substitute(x=>"$a");
$z = $a - $a;

##############################################################
#
#  Text
#
#

Context()->texStrings;
BEGIN_TEXT
$BR
(a) Enter the limit definition of the derivative function of \(f\).  To enter \(\Delta x\), type deltax with no spaces. 
$BR 
$BR
\{
 BeginTable(center=>0).
     Row(['\(\displaystyle f^\prime(x) =\) ','\(\hskip 30pt\lim\)'.$BR.ans_rule(5).'\(\longrightarrow\)'.ans_rule(1),ans_rule(10).'\( - \)'.ans_rule(10).$BR.'------------------------------------------------'.$BR.'\(\hskip 43pt\)'.ans_rule(5),
     ],separation=>2).
   EndTable();
\}
$BR
$BR
(b) Use the definition of the derivative to compute the derivative of \($f\) by completing the given steps:
$BR
$BR
Substitute in $BITALIC x $EITALIC + \(\Delta x \):
$BR
$BR
\{
 BeginTable(center=>0).
     Row(['\(\displaystyle \left($f\right)^\prime =\lim_{\Delta x\to 0}\) ',ans_rule(10).'\( - \)'.ans_rule(10).$BR.'------------------------------------------------'.$BR.'\(\hskip 43pt\)'.ans_rule(5),
     ],separation=>2).
   EndTable();
\}
$BR
$BR
FOIL and eliminate parentheses in the first term of the numerator:
$BR
$BR
\{
 BeginTable(center=>0).
     Row(['\(=\displaystyle\lim_{\Delta x\to 0}\) ',ans_rule(30).'\( - \)'.ans_rule(3).$BR.'-----------------------------------------------------------------'.$BR.'\(\hskip 65pt\)'.ans_rule(5),
     ],separation=>2).
   EndTable();
\}
$BR
$BR
Cancel like terms in the numerator:
$BR
$BR
\{
 BeginTable(center=>0).
     Row(['\(=\displaystyle\lim_{\Delta x\to 0}\) ',ans_rule(30).$BR.'------------------------------------------------'.$BR.'\(\hskip 45pt\)'.ans_rule(5),
     ],separation=>2).
   EndTable();
\}
$BR
$BR
Cancel like factors in the numerator and denominator:
$BR
$BR
\( \displaystyle
=\lim_{\Delta x\to 0}\)\{ans_rule\}
$BR
$BR
Set \(\Delta x\) equal to 0:
$BR
$BR
\( \displaystyle
=\)\{$fprime->ans_rule\}
$BR
$BR
Now check your answer by using the derivative formula for a quadratic...



END_TEXT
Context()->normalStrings;

##############################################################
#
#  Answers
#
#

WEIGHTED_ANS($DQden->cmp,1); 
WEIGHTED_ANS($z->cmp,1); 
WEIGHTED_ANS(Compute("f(x+deltax)")->cmp(),10);
WEIGHTED_ANS(Compute("f(x)")->cmp(),10);
WEIGHTED_ANS($DQden->cmp,1);
 
WEIGHTED_ANS($DQnum1->cmp, 13);
WEIGHTED_ANS($DQnum2->cmp, 5);
WEIGHTED_ANS($DQden->cmp , 3);

WEIGHTED_ANS($DQnum1simplified->cmp, 13);
WEIGHTED_ANS($DQnum2->cmp, 3);
WEIGHTED_ANS($DQden->cmp, 1);

WEIGHTED_ANS($DQnumerator->cmp, 13);
WEIGHTED_ANS($DQden->cmp, 1);

WEIGHTED_ANS($DQ->cmp, 13);
WEIGHTED_ANS($fprime->cmp, 12);
ENDDOCUMENT();        
