# WeBWorK problem written by Alex Jordan 
# Portland Community College
# ENDDESCRIPTION




##############################################

DOCUMENT();

loadMacros(
  "PGstandard.pl",
  "MathObjects.pl",
  "PGpolynomialmacros.pl",
  "contextPolynomialFactors.pl",
  "contextLimitedPowers.pl",
  
);

TEXT(beginproblem());
##############################################


Context("Numeric");
Context()->reduction->set('(-x)-y'=>0, '(-x)+y'=>0); 
$var = list_random('x','y','z','t','r');
Context()->variables->are(x=>'Real',$var=>'Real');

$a = random(2,8,1);
$b = random(1,8,1);

@p1 = ($a,$b);
@p2 = ($a,-$b);
@product = PolyMult(~~@p1,~~@p2);

$poly1 = Formula(PolyString(~~@p1));
$poly2 = Formula(PolyString(~~@p2));
$polynomial = Formula(PolyString(~~@product));
$poly1 = $poly1->substitute(x=>$var);
$poly2 = $poly2->substitute(x=>$var);
$polynomial = $polynomial->substitute(x=>$var);


Context("PolynomialFactors-Strict");
Context()->variables->are($var=>'Real');
Context()->flags->set(singleFactors=>0);
LimitedPowers::OnlyIntegers( minPower => 0, maxPower => 1, 
  message => "either 0 or 1",);
Context()->strings->add('prime'=>{}, 'it is prime'=>{alias=>'prime'});


Context()->operators->undefine('/');
$factored = Compute("($poly1)($poly2)")->reduce;
#$factored = Compute("prime");





##############################################

Context()->texStrings;

BEGIN_TEXT

Factor this polynomial.

$PAR


$SPACE $SPACE $SPACE \( $polynomial \)

$PAR


\{ans_rule(20)\}



 




END_TEXT

Context()->normalStrings;

##############################################
$showPartialCorrectAnswers = 1;


ANS($factored->cmp(typeMatch=>Formula("$var")));


ENDDOCUMENT();
