##DESCRIPTION
##  
##ENDDESCRIPTION

##KEYWORDS('difference', 'quotient')

## DBsubject('Calculus')
## DBchapter('Limits and Derivatives')
## DBsection('Definition of the Derivative')
## Date('8/22/2011')
## Author('Darwyn Cook')
## Institution('Alfred University')
## TitleText1('AUCI')
## EditionText1('1')
## AuthorText1('')
## Section1('2.3')
## Problem1('')

########################################################################

DOCUMENT();      

loadMacros(
   "PGstandard.pl",     # Standard macros for PG language
   "MathObjects.pl",
   #"source.pl",        # allows code to be displayed on certain sites.
   "PGcourse.pl",      # Customization file for the course
   "Alfredmacros.pl",
   "contextLimitedPolynomial.pl",
   "weightedGrader.pl",
);
jsmathmode();
install_weighted_grader();

# Print problem number and point value (weight) for the problem
TEXT(beginproblem());

# Show which answers are correct and which ones are incorrect
$showPartialCorrectAnswers = 1;

##############################################################
#
#  Setup
#
#  Define the function f and the terms in the numerator of the difference
#  quotient. We do this at a general point x, and at a fixed point a.
Context("Numeric");
Context()->{error}{msg}{"'deltax' is not defined in this context"} 
= "You have to take the limit";
$cancel = Context()->copy;
$nodeltax=Context()->copy;

Context("LimitedPolynomial");
Context()->variables->add(deltax=>'Real');
Context()->variables->set(deltax => {TeX => '{\Delta x}'});
Context()->operators->undefine("-");
Context()->{error}{msg}{"Can't use '-' in this context"} 
= "You didn't cancel like terms";
Context()->{error}{msg}{"In a polynomial, you can only divide by numbers"} 
= "At this point you can simplify by dividing the numerator by deltax";
$cancel = Context()->copy;



Context("Numeric");
Context()->variables->add(deltax=>'Real');
Context()->variables->set(deltax => {TeX => '{\Delta x}'});
$DQ = Context()->copy;


$b = Compute(non_zero_random(2,9,.1));

$f = Formula($nodeltax,"($b)^x")->reduce;
$fDQ = Formula($DQ,"$f");
$DQnum1 = $fDQ->substitute(x=>"x+deltax");
$DQnum2 = $fDQ->substitute(x=>"deltax");

$limit = Formula("(($b)^deltax-1)/deltax");
@tablex = (Compute("$x0-0.01"),Compute("$x0-0.001"),Compute("$x0-0.00001"),Compute("$x0+0.00001"),Compute("$x0+0.0001"),Compute("$x0+0.01"));

@tabledydx = ($limit->eval(x=>"0",deltax=>"$tablex[0]"),$limit->eval(x=>"0",deltax=>"$tablex[1]"),$limit->eval(x=>"0",deltax=>"$tablex[2]"),$limit->eval(x=>"0",deltax=>"$tablex[3]"),$limit->eval(x=>"0",deltax=>"$tablex[4]"),$limit->eval(x=>"0",deltax=>"$tablex[5]"));

$fprime = $f->D('x');


##############################################################
#
#  Text
#
#

Context()->texStrings;
BEGIN_TEXT
Compute the derivative of \(f(x) = $f\) using the difference quotient definition. For \(\Delta x\) type deltax (with no spaces).
$BR
\[
\begin{aligned}
f^\prime(x) =& \lim_{\Delta x\to 0} \frac{f(x+\Delta x)-f(x)}{\Delta x}\\
&\\
&\hbox{substitute x + }\Delta x\hbox{ into f}\\
&\\
=&\lim_{\Delta x\to 0} \frac{\hbox{\{ans_rule(17)\}}-{\hbox{\{ans_rule(3)\}}}}{\Delta x}\\
&\\
&\\
=&$f\lim_{\Delta x\to 0} \frac{\hbox{\{ans_rule(10)
\}}-{\hbox{\{ans_rule(3)\}}}}{\Delta x}\\
&\\
=&c$F
\end{aligned}
\]
At this point we know that the derivative of \($f\) is a constant multiple of \($f\), now we need to figure out what that multiple is. 
$BR
$BCENTER
\{ begintable(9) \}
\{ row( "\(x \)", "\($tablex[0]\)", "\($tablex[1]\)", "\($tablex[2]\)","\(\rightarrow\)","\($x0\)","\(\leftarrow\)","\($tablex[3]\)","\($tablex[4]\)","\($tablex[5]\)" ) \}
\{ row( "approximation to c", $tabledydx[0]->ans_rule, $tabledydx[1]->ans_rule, $tabledydx[2]->ans_rule,"\(\rightarrow\)","???","\(\leftarrow\)",$tabledydx[3]->ans_rule,$tabledydx[4]->ans_rule,$tabledydx[5]->ans_rule) \}
\{ endtable() \}
$ECENTER
$BR
See if you can find  c in the table:
$BR
$BCENTER
\{ begintable(2) \}
\{ row( "x", "\(\ln(x)\)")\}
\{ row( $b-.5, ln($b-.5))\}
\{ row( $b-.4, ln($b-.4))\}
\{ row( $b-.3, ln($b-.3))\}
\{ row( $b-.2, ln($b-.2))\}
\{ row( $b-.1, ln($b-.1))\}
\{ row( $b, ln($b))\}
\{ row( $b+.1, ln($b+.1))\}
\{ row( $b+.2, ln($b+.2))\}
\{ row( $b+.3, ln($b+.3))\}
\{ row( $b+.4, ln($b+.4))\}
\{ row( $b+.5, ln($b+.5))\}
\{ endtable() \}
$ECENTER
$BR
\(c = \) \{ans_rule\}
$BR
Therefore \(f^\prime(x) =\) \{ans_rule\}
END_TEXT
Context()->normalStrings;

##############################################################
#
#  Answers
#
#
ANS($DQnum1->cmp() );
ANS($f->cmp() );

ANS($DQnum2->cmp() );
ANS(Compute("1")->cmp() );

ANS($tabledydx[0]->cmp);
ANS($tabledydx[1]->cmp);
ANS($tabledydx[2]->cmp);
ANS($tabledydx[3]->cmp);
ANS($tabledydx[4]->cmp);
ANS($tabledydx[5]->cmp);

ANS(Compute("ln($b)")->cmp(tolType=>'absolute',
               tolerance=>.00000000001));
ANS($fprime->cmp(tolType=>'absolute',
               tolerance=>.00000000001) );

ENDDOCUMENT();        
