## MO(1)
# WeBWorK problem written by Alex Jordan 
# Portland Community College
# ENDDESCRIPTION




##############################################

DOCUMENT();

loadMacros(
  "PGstandard.pl",
  "MathObjects.pl",
  "contextFraction.pl",
  
);

TEXT(beginproblem());
##############################################

Context("Numeric");
$var = list_random('x','y','z','t','r');
Context()->variables->are($var=>'Real');

$a = non_zero_random(-10,10,1);
$b = non_zero_random(-10,10,1);
$c = non_zero_random(-10,10,1);
while ($b**2-4*$a*$c <= 0) 
{$a = non_zero_random(-10,10,1);
$b = non_zero_random(-10,10,1);
$c = non_zero_random(-10,10,1);}

$left = Compute("$a $var**2 + $b $var + $c")->reduce;
$right = Compute("0"); 

Context()->flags->set(reduceConstantFunctions=>0);

$r1 = Compute("(-$b+sqrt(($b)**2-4*$a*$c))/(2*$a)");
$r2 = Compute("(-$b-sqrt(($b)**2-4*$a*$c))/(2*$a)");

Context("Interval");
Context()->flags->set(reduceConstantFunctions=>0);
Context()->parens->set('{'=>{type=>'Set'});
$ans = Compute("{$r1,$r2}");



##############################################

Context()->texStrings;

BEGIN_TEXT

Solve the equation for \($var\). Enter the solution set using set notation.  For example: \($LBRACE 1,2$RBRACE\).
$PAR

\[$left = $right \]

$PAR

If you need to use a square root, type $BBOLD sqrt(23)$EBOLD for \(\sqrt{23}\) (for example). 
$BR
If the equation has no solutions, you can still use set notation by entering \($LBRACE$RBRACE\).
$PAR

The solution set is \{ans_rule(40)\}.



END_TEXT

Context()->normalStrings;

##############################################
$showPartialCorrectAnswers = 1;


ANS( $ans->cmp(tolerance=>0.00001));


ENDDOCUMENT();
